In [1]:
import pandas as pd

In [8]:
lista = 'l1 l2 l3 l4'.split()

In [11]:
data = [(1,2,3,4),
       (5,6,7,8),
       (9,10,11,12),
       (13,14,15,16)]

df = pd.DataFrame(data, lista, 'c1 c2 c3 c4'.split())

In [12]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [15]:
df[['c1','c2', 'c3']]

    c1  c2  c3
l1   1   2   3
l2   5   6   7
l3   9  10  11
l4  13  14  15

In [16]:
type(df[['c1','c2', 'c3']])

pandas.core.frame.DataFrame

In [32]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [34]:
df[1:][['c1', 'c3']]

    c1  c3
l2   5   7
l3   9  11
l4  13  15

In [36]:
# Pega a linha e monta uma series
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [38]:
df.loc[['l3','l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [40]:
# Localiza valores
df.loc['l3','c3']

11

In [46]:
df.loc[['l3','l1'],['c4', 'c3']]

    c4  c3
l3  12  11
l1   4   3

In [42]:
# Seleciona por index
df.iloc[0,1]

2

In [47]:
df.iloc[[2,0],[3, 2]]

    c4  c3
l3  12  11
l1   4   3